In [1]:
#imports

import pandas as pd
import os

In [2]:
# import all the files form the location 

files = [file for file in os.listdir('./Data')]

In [3]:
### Merge the data

all_months_data = pd.DataFrame()

for file in files:
    df = pd.read_csv("./Data/"+file)
    all_months_data = pd.concat([all_months_data,df])

In [4]:
# export to a csv file

all_months_data.to_csv("all_data.csv", index=False)

In [5]:
# imprt the data

all_data = pd.read_csv("all_data.csv")

## Overview of the data

In [6]:
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [7]:
all_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 8.6+ MB

In [8]:
# Basic statistics about the data

all_data.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

The describe function did not return all the information we needed as all data types are Object. We will change the data types later and run the command again.

In [9]:
# Check for null values


print(f"Total number of null values: {all_data.isna().sum().sum()}") # Null values accross all the data set
print("Number of null values in each columns: ")
print(all_data.isna().sum()) # Null values for each column

Total number of null values: 3270
Number of null values in each columns:
Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [10]:
# Dropping nulll values, copy the resulting dataframe into a new variable "new_data"

new_data = all_data.dropna(axis=0, how='all').copy(deep=True)

In [11]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186305 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 9.9+ MB

In [12]:
# Confirming all new values have been removed

new_data.isna().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [13]:
#change data type for "Quantity Ordered" "Price Each" "Order Date"

import traceback


try:
    new_data['Quantity Ordered'] = pd.to_numeric(new_data['Quantity Ordered'])
except Exception as e:
    tb = traceback.format_exc()
    print(tb)

Traceback (most recent call last):
  File "pandas\_libs\lib.pyx", line 2305, in pandas._libs.lib.maybe_convert_numeric
ValueError: Unable to parse string "Quantity Ordered"

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Dilimou\AppData\Local\Temp/ipykernel_34628/4108262790.py", line 7, in <module>
    new_data['Quantity Ordered'] = pd.to_numeric(new_data['Quantity Ordered'])
  File "c:\Users\Dilimou\anaconda3\envs\env\lib\site-packages\pandas\core\tools\numeric.py", line 183, in to_numeric
    values, _ = lib.maybe_convert_numeric(
  File "pandas\_libs\lib.pyx", line 2347, in pandas._libs.lib.maybe_convert_numeric
ValueError: Unable to parse string "Quantity Ordered" at position 517

We have some issues with the row '517', let's view the error

In [14]:
new_data.iloc[517]

Order ID                    Order ID
Product                      Product
Quantity Ordered    Quantity Ordered
Price Each                Price Each
Order Date                Order Date
Purchase Address    Purchase Address
Name: 519, dtype: object

The row has some invalid values not integer, let look for extra columns with the same issue

In [15]:
# Check for rows with the values for "Quantity Ordered" is equal "Quantity Ordered"

new_data[new_data['Quantity Ordered'] == "Quantity Ordered"].count()

Order ID            355
Product             355
Quantity Ordered    355
Price Each          355
Order Date          355
Purchase Address    355
dtype: int64

In [16]:
# Remove rows with incorrect data, copy the resulting dataframe in a new variable "new_new_data"

new_new_data = new_data[new_data['Quantity Ordered'] != "Quantity Ordered"].copy(deep=True)

In [17]:
# Check if there are additional incorrect data

new_new_data[new_new_data['Quantity Ordered'] == "Quantity Ordered"].count()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [18]:
# Convert "Quantity Ordered" to numeric

new_new_data['Quantity Ordered'] = pd.to_numeric(new_new_data['Quantity Ordered'])

In [19]:
# Convert "Price Each" to numeric

new_new_data['Price Each'] = pd.to_numeric(new_new_data['Price Each'])

In [20]:
# Convert "Order Date" to datetime

new_new_data['Order Date'] = pd.to_datetime(new_new_data['Order Date'])

In [21]:
# Check current data types

new_new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 9.9+ MB

In [22]:
new_new_data.describe()

       Quantity Ordered     Price Each
count     185950.000000  185950.000000
mean           1.124383     184.399735
std            0.442793     332.731330
min            1.000000       2.990000
25%            1.000000      11.950000
50%            1.000000      14.950000
75%            1.000000     150.000000
max            9.000000    1700.000000

In [23]:
# After converting some of the columns data types, Lets check once more for null/NaN values

new_new_data.isna().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

## Adding additonal columns necessary for later analysis

In [24]:
# Get the city form the "Purchase Address" column

new_new_data.iloc[0]['Purchase Address'].split(',')[1].strip()

'Dallas'

In [25]:
# Get the state form the "Purchase Address" column

new_new_data.iloc[0]['Purchase Address'].split(',')[2].split(' ')[1]

'TX'

In [26]:
# Add the above information to form the "City" column

new_new_data['City'] = new_new_data['Purchase Address'].apply(lambda x: x.split(',')[1].strip()+"("+x.split(',')[2].split(' ')[1]+")")

In [27]:
new_new_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,City
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",Dallas(TX)
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",Boston(MA)
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",Los Angeles(CA)
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",Los Angeles(CA)
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",Los Angeles(CA)

In [28]:
# Add column "Total Price" using the "Price Each" and "Quantity Ordered" columns

new_new_data['Total Price'] = new_new_data.loc[:,'Quantity Ordered']*new_new_data.loc[:,'Price Each']

In [29]:
# Add "Month" column derived from the "Order Date" column

new_new_data['Month']=new_new_data.loc[:,'Order Date'].dt.month

In [30]:
# Add "Day" column derived from the "Order Date" column

new_new_data['Day']=new_new_data.loc[:,'Order Date'].dt.day

In [31]:
new_new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
 6   City              185950 non-null  object
 7   Total Price       185950 non-null  float64
 8   Month             185950 non-null  int64
 9   Day               185950 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 15.6+ MB

In [32]:
new_new_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,City,Total Price,Month,Day
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",Dallas(TX),23.90,4,19
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",Boston(MA),99.99,4,7
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",Los Angeles(CA),600.00,4,12
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",Los Angeles(CA),11.99,4,12
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",Los Angeles(CA),11.99,4,30